Upgrade test will fail because of underlying COS module changes.
New version of COS module has updated lifecycle configuration block for bucket, added suffix for bucket names -- hence it is breaking for this example. 

```
  # module.cos.ibm_cos_bucket.cos_bucket1[0] must be replaced
-/+ resource "ibm_cos_bucket" "cos_bucket1" {
      - allowed_ip           = [] -> null
      ~ bucket_name          = "sa-14nov-bucket" -> (known after apply) # forces replacement
      ~ crn                  = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ad9bc2b4-4aff-42d2-93fe-2e21d4ace232:bucket:sa-14nov-bucket" -> (known after apply)
      - hard_quota           = 0 -> null
      ~ id                   = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ad9bc2b4-4aff-42d2-93fe-2e21d4ace232:bucket:sa-14nov-bucket:meta:rl:us-south:public" -> (known after apply)
      ~ s3_endpoint_direct   = "s3.direct.us-south.cloud-object-storage.appdomain.cloud" -> (known after apply)
      ~ s3_endpoint_private  = "s3.private.us-south.cloud-object-storage.appdomain.cloud" -> (known after apply)
      ~ s3_endpoint_public   = "s3.us-south.cloud-object-storage.appdomain.cloud" -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cos.ibm_cos_bucket_lifecycle_configuration.cos_bucket_lifecycle[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "ibm_cos_bucket_lifecycle_configuration" "cos_bucket_lifecycle" {
      - bucket_crn      = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ad9bc2b4-4aff-42d2-93fe-2e21d4ace232:bucket:sa-14nov-bucket" -> null
      - bucket_location = "us-south" -> null
      - endpoint_type   = "public" -> null
      - id              = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:ad9bc2b4-4aff-42d2-93fe-2e21d4ace232:bucket:sa-14nov-bucket:meta:us-south:public" -> null

      - lifecycle_rule {
          - rule_id = "expiry-rule" -> null
          - status  = "enable" -> null

          - expiration {
              - days                         = 365 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }

          - filter {
              - object_size_greater_than = 0 -> null
              - object_size_less_than    = 0 -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - rule_id = "archive-rule" -> null
          - status  = "enable" -> null

          - filter {
              - object_size_greater_than = 0 -> null
              - object_size_less_than    = 0 -> null
                # (1 unchanged attribute hidden)
            }

          - transition {
              - days          = 90 -> null
              - storage_class = "GLACIER" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.cos.random_string.bucket_name_suffix[0] will be created
  + resource "random_string" "bucket_name_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.cos.time_sleep.wait_for_cos_bucket_lifecycle[0] will be destroyed
  # (because time_sleep.wait_for_cos_bucket_lifecycle is not in configuration)
  - resource "time_sleep" "wait_for_cos_bucket_lifecycle" {
      - create_duration = "90s" -> null
      - id              = "2025-11-14T04:58:08Z" -> null
    }

  # module.schematics_agent.ibm_schematics_agent.schematics_agent_instance will be updated in-place
  ~ resource "ibm_schematics_agent" "schematics_agent_instance" {
        id                    = "sa-14nov-agent.soA.16b7"
        name                  = "sa-14nov-agent"
      + run_destroy_resources = 0
      + tags                  = []
      ~ version               = "1.3.1" -> "1.5.0"
        # (14 unchanged attributes hidden)

      ~ agent_infrastructure {
          ~ cos_bucket_name        = "sa-14nov-bucket" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      + agent_metadata {
          + name  = "Purpose"
          + value = [
              + "git",
              + "terraform",
            ]
        }

        # (1 unchanged block hidden)
    }

  # module.schematics_agent.null_resource.agent_deployment_status will be created
  + resource "null_resource" "agent_deployment_status" {
      + id = (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

It is safe to skip upgrade test for this PR.